app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."email" = $1 LIMIT $2  [["email", "postman@mail.com"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by_email(params[:email])