app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL
---
  def index
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def verify_information
    @user = User.find(params[:id])